[
  {
    "name": "Why can't the status bar be transparent?",
    "content": "This app works by making an overlay on top of the existing status bar, similar to how chat bubbles or a screen dimming app would work. This means that if it is made transparent, the system icons would be visible underneath it."
  },
  {
    "name": "How can I prevent lag?",
    "content": "Lag can be prevented mostly by minimizing the amount of times the status bar has to update. This can be done by disabling animations, resourced-based colors, and removing any icons that aren't completely necessary for the status bar to function."
  },
  {
    "name": "The status bar uses the wrong color for my app.",
    "content": "Status cannot detect color changes that happen after a screen is opened, only preset colors. This can make the colors of some apps slightly inaccurate, so it is recommended to set a neutral color for screens that can have multiple primary colors. For developers: Status mainly uses the 'R.attr.colorPrimaryDark' or 'R.color.colorPrimaryDark' resources to get the colors."
  },
  {
    "name": "The status bar isn't showing notification icons.",
    "content": "First, check that you have the 'show notifications' option in the 'settings' tab enabled. Then open the setup screen (three dots -> setup). If you are running android 4.3 or higher, click on 'compatibility mode' and turn on the switch at the bottom. If compatibility mode is already enabled, turning it off sometimes fixes the issue as well. Another useful thing to note is that sometimes clearing the app data can help fix issues similar to this one."
  },
  {
    "name": "The status bar doesn't remove notifications until the notification panel is opened.",
    "content": "If you are running android 4.3 or higher, open the setup screen (three dots -> setup), click on 'compatibility mode', and make sure it is not enabled. If you're below android 4.3, this issue is due to a limitation of android and this is (unfortunately) the best I can do to support your device at the moment."
  },
  {
    "name": "Why isn't the top part of my wallpaper aligned on the home screen?",
    "content": "If the 'transparency on home screen' option is enabled, the app will get a static image of the wallpaper and set it as the status bar's background whenever you are on your home screen. This can create a few issues with scrolling wallpapers, as it isn't possible to detect the current page of the home screen. If you are using a custom launcher, it's usually pretty easy to prevent the wallpaper from scrolling in the launcher's settings menu, but otherwise the only option you really have is to disable the transparency setting. It can also be affected by shadows at the top and bottom of the screen and devices that don't natively support the ability to have a transparent status bar."
  },
  {
    "name": "Why is the status bar showing the wrong wallpaper on my home screen?",
    "content": "The 'transparency on home screen' option does not currently have support for live wallpapers - it will simply get the most recent image wallpaper instead."
  },
  {
    "name": "My phone is dual sim, but it doesn't show the second signal strength icon.",
    "content": "Status does not currently support dual sim as it works differently on almost every device and is difficult to implement. This is being worked on, however, and the app will be updated as soon as it is stable."
  },
  {
    "name": "How do you change the time format?",
    "content": "The clock format can be changed through the 'time format' option for the clock icon. The clock will replace certian characters inputted into the dialog with the associated variables, for example to show the time in a 24 hour format you would input \"HH:MM\", or to show the AM/PM indicator \"h:mm a\"."
  },
  {
    "name": "Why isn't the notification panel themed?",
    "content": "The notification panel would take a lot of time to complete, and I feel it would be a better use of time to improve the speed and stability of the app before adding any more significant features."
  },
  {
    "name": "Status isn't affected by my screen dimming app.",
    "content": "In order to be shown over the status bar, Status needs to be drawn 'on top of' everything else as well. This includes system overlays from other apps, including screen dimmers or chat bubbles."
  }
]
